export const deckRestrictionsLastUpdated = '2026/2/4'

export const deckRestrictions = {
  'dc': {
    choice: [
      [
        { 水着の杏: ['DC/W01-091', 'DC/WC01-091', 'DC/W81-P02S'] },
        { 木琴占い: ['DC/W01-095', 'DC/WC01-095', 'DC/W81-P01S'] },
      ],
    ],
  },
  'sy': {
    banned: [{ 情報連結解除: ['SY/W08-T16', 'SY/W08-097'] }],
  },
  'persona': {
    banned: [{ '神木 秋成': ['P3/S01-014', 'P3/SC01-014'] }],
  },
  'kc': {
    choice: [
      [
        { '陽炎型駆逐艦7番艦 初風': ['KC/S25-006', 'KC/S42-105'] },
        { '暁型駆逐艦2番艦 響': ['KC/S25-056'] },
      ],
    ],
  },
  'bd': {
    banned: [{ 'キラキラを求めて 香澄': ['BD/W47-P28', 'BD/W47-P28S'] }],
    choice: [
      [
        { 市ヶ谷有咲: ['BD/W47-082', 'BD/W47-082SP'] },
        { がんばれパン: ['BD/W54-065', 'BD/WE42-P36', 'BD/W125-063', 'BD/W125-063S'] },
        { '拒絶の言葉 豊川祥子': ['BD/W125-010', 'BD/W125-010S'] },
      ],
    ],
  },
  'hll': {
    limited: [{ cardName: '見守る者 学園長', cardId: ['HLL/WE29-11'], limit: 1 }],
  },
  'fate': {
    choice: [
      [
        { '銀糸錬金 天使の詩 イリヤ': ['FS/S34-078', 'FS/S34-078S', 'FS/S77-079', 'FS/S77-079S'] },
        { '“闇夜の巡回”凛＆アーチャー': ['FS/S36-P03'] },
        { 'HEROIC 凛＆アーチャー': ['FS/S64-063', 'FS/S64-063S'] },
      ],
    ],
  },
  'dal': {
    limited: [
      {
        cardName: '“最悪の精霊”狂三',
        cardId: ['DAL/W79-053', 'DAL/W79-053SEC', 'DAL/W131-P04S'],
        limit: 2,
      },
    ],
  },
  'sao': {
    banned: [{ '真っ直ぐな道 アリス': ['SAO/S100-011', 'SAO/S100-011S'] }],
  },
  'lsp': {
    banned: [{ 'ギャラクシー すみれ': ['LSP/W92-062'] }],
    choice: [
      [
        { 'ソングフォーオール!!': ['LSP/W92-038'] },
        { 'Liella! 可可': ['LSP/W92-083', 'LSP/W92-083S'] },
      ],
    ],
  },
  'all': {
    limited: [
      {
        cardName: '“その笑顔を守るために”叶星',
        cardId: ['ALL/S90-008', 'ALL/S90-008SP'],
        limit: 3,
      },
    ],
  },
  '5hy': {
    limited: [
      { cardName: '走り出す恋心 中野 二乃', cardId: ['5HY/W90-052', '5HY/W90-052SSP'], limit: 2 },
    ],
    choice: [
      [
        { 大切なお守り: ['5HY/W83-100'] },
        { '回る日常 中野 二乃': ['5HY/W90-053', '5HY/W90-053S'] },
        { '微睡の中 中野 一花': ['5HY/W90-061', '5HY/W90-061S'] },
        { 'ありがとうの花 中野 二乃': ['5HY/W101-081', '5HY/W101-081HYR'] },
        { 'めいっぱいのアプローチ 中野 二乃': ['5HY/WE43-23', '5HY/WE43-23IGP'] },
      ],
    ],
  },
  'hol': {
    banned: [{ 'アニキ 百鬼あやめ': ['HOL/W104-099', 'HOL/W104-099S'] }],
    limited: [
      {
        cardName: '未来へと踏み出す一歩 がうる・ぐら',
        cardId: ['HOL/W104-113', 'HOL/W104-113S', 'HOL/W104-113SP'],
        limit: 2,
      },
    ],
    choice: [
      [
        { 姫森ルーナ: ['HOL/W91-057', 'HOL/W91-057S'] },
        { 'はあちゃまビーム 赤井はあと': ['HOL/W91-105', 'HOL/W91-105S'] },
        { 'この世のものは脆すぎる 天音かなた': ['HOL/WE44-P04', 'HOL/W104-035', 'HOL/W104-035S'] },
        { 'プールでまったり 大神ミオ': ['HOL/W104-040', 'HOL/W104-040S', 'HOL/W104-040SSP'] },
        { '二人きりのアンコール 尾丸ポルカ': ['HOL/W104-069', 'HOL/W104-069S', 'HOL/W104-069SSP'] },
      ],
    ],
  },
  'dct': {
    limited: [
      { cardName: '夢見る高校生 蘭堂', cardId: ['DCT/S86-079', 'DCT/S86-079SP'], limit: 3 },
    ],
    choice: [
      [
        { '最高のアイドル ありや': ['DCT/S86-002', 'DCT/S86-002SP'] },
        { '気付いた感情 える': ['DCT/S86-076', 'DCT/S86-076SP'] },
        { '不思議な転校生 える': ['DCT/S86-088'] },
      ],
    ],
  },
  'ovl': {
    banned: [{ '豊穣の母神からの返礼 アインズ': ['OVL/S99-032', 'OVL/S99-032S'] }],
    choice: [
      [
        { '魔導王 アインズ': ['OVL/S99-028', 'OVL/S99-028SP'] },
        { '吸血鬼の真祖 シャルティア': ['OVL/S62-062', 'OVL/SE54-53', 'OVL/SE54-53OLR'] },
      ],
    ],
  },
  'key': {
    choice: [
      [
        { '思い出とたい焼き あゆ': ['Kka/W102-003', 'Kka/W102-003SP'] },
        { 宝物になった日: ['Kdb/W102-068', 'Kdb/W102-068S'] },
        { '最後の夏やすみ 観鈴': ['Kai/W102-077', 'Kai/W102-077SP'] },
        { 'ひげ猫団 鴎': ['Ksm/W102-037', 'Ksm/W102-037S'] },
      ],
    ],
  },
  'tsk': {
    choice: [
      [
        { '“爆炎の支配者”シズ': ['TSK/S70-065', 'TSK/S70-065SP'] },
        { '静かなる怒り シュナ': ['TSK/S101-052', 'TSK/S101-052S'] },
        { '強者の元へ ベニマル': ['TSK/S101-054', 'TSK/S101-054S'] },
        { '自由を告げる鼓動 ミュウラン': ['TSK/S101-077', 'TSK/S101-077SP'] },
      ],
    ],
  },
  'csm': {
    limited: [
      { cardName: '公安対魔特異4課 早川アキ', cardId: ['CSM/S96-029', 'CSM/S96-029S'], limit: 2 },
    ],
    choice: [
      [{ '同盟結成 姫野': ['CSM/S96-085'] }, { '休憩中 姫野': ['CSM/S96-086', 'CSM/S96-086S'] }],
    ],
  },
  'pad': {
    limited: [
      { cardName: '甘美の零龍喚士・ネイ', cardId: ['PAD/S105-003', 'PAD/S105-003SP'], limit: 1 },
    ],
  },
  'sby': {
    limited: [
      {
        cardName: '君と過ごした一年間 桜島 麻衣',
        cardId: ['SBY/W114-049', 'SBY/W114-049ABR', 'SBY/W114-049OFR'],
        limit: 2,
      },
    ],
  },
  'isc': {
    limited: [
      {
        cardName: '伸ばす手に乗せるのは 風野灯織',
        cardId: ['ISC/S110-009', 'ISC/S110-009SP'],
        limit: 1,
      },
    ],
    choice: [
      [
        { '283プロダクション': ['ISC/S81-T075'] },
        { 'たそかれスワッグ 八宮めぐる': ['ISC/S110-004', 'ISC/S110-004OFR', 'ISC/S110-004SSP'] },
        { 'アンシーン・ダブルキャスト 黛 冬優子': ['ISC/S110-038', 'ISC/S110-038SP'] },
        { 'interStellar-Stella 櫻木真乃': ['ISC/S110-061', 'ISC/S110-061OFR', 'ISC/S110-061SSP'] },
        { 'Beautiful Sunset 白瀬咲耶': ['ISC/S110-093', 'ISC/S110-093WIR'] },
      ],
    ],
  },
  'pjs': {
    choice: [
      [
        { 'その心意気を買って 神代類': ['PJS/S109-001', 'PJS/S109-001SSP'] },
        { 'アウトドアクッキング！ 青柳冬弥': ['PJS/S109-060', 'PJS/S109-060SSP'] },
      ],
    ],
  },
  'ags': {
    choice: [
      [
        { '“ツナギをまとった天使”リタ': ['AGS/W108-005', 'AGS/W108-005SP'] },
        { '相河 愛花': ['AGS/W108-009', 'AGS/W108-009S'] },
        { '“ワイルド・ワイルド・ムードメーカー”リン': ['AGS/W108-032', 'AGS/W108-032SP'] },
        { '私に出来ること 夜露': ['AGS/W108-034', 'AGS/W108-034S'] },
        { '暴走 のどか': ['AGS/W108-038', 'AGS/W108-038S'] },
      ],
    ],
  },
  'uma': {
    choice: [
      [
        { 'シニカルガール ナイスネイチャ': ['UMA/W106-T11', 'UMA/W106-T11R'] },
        { '学園理事長 秋川やよい': ['UMA/W106-035', 'UMA/W106-035S'] },
        { 'ブリュニサージュ・ライン メジロブライト': ['UMA/W106-131', 'UMA/W106-131SP'] },
      ],
    ],
  },
  'cs': {
    limited: [
      { cardName: '“おわり”のない映画', cardId: ['CS/S114-047', 'CS/S114-047S'], limit: 1 },
    ],
  },
  're0': {
    choice: [
      [
        { 'パジャマパーティー レム': ['RZ/S116-P09S', 'RZ/S116-P09EX'] },
        { '無防備なあくび レム': ['RZ/S116-078', 'RZ/S116-078S', 'RZ/S116-078SP'] },
        { 'ギンガムチェックの案内人 レム': ['RZ/S116-083', 'RZ/S116-083S'] },
      ],
    ],
  },
  'lhs': {
    choice: [
      [
        { 'Dream Believers 百生 吟子': ['LHS/W122-002', 'LHS/W122-002S', 'LHS/W122-002EX'] },
        { 'みんなで叶える物語 藤島 慈': ['LHS/W122-009', 'LHS/W122-009S', 'LHS/W122-009SP'] },
        { 'PASSION!!!!!! 藤島 慈': ['LHS/W122-012', 'LHS/W122-012S'] },
        { 'ハクチューアラモード 大沢 瑠璃乃': ['LHS/W122-050', 'LHS/W122-050S'] },
      ],
    ],
  },
}
